const path = require ('path')

module.exports = {

////////////////////////////////////////////////////////////////////////////////

get_xsd_path_of_p_e_r_n_a_m_e_i_n_f:

    function () {

		return path.join (__dirname, '..', 'Static/zags-pernameinf-ru-root.xsd')

    },

////////////////////////////////////////////////////////////////////////////////

get_request_of_p_e_r_n_a_m_e_i_n_f:

    function () {

		return this.rq.data
    	
    },

////////////////////////////////////////////////////////////////////////////////

get_response_of_p_e_r_n_a_m_e_i_n_f:

    function () {
/*    
    	const {rq: {data}} = this
*/
    	return {
  "PERNAMEINFResponse": {
    "ИдЗапрос": "0bde2079-eded-11ea-952d-00155d01aa22",
    "ДатаСвед": "1957-08-13",
    "КолДок": "1",
    "ТипАГСЗапрос": "06",
    "schemaLocation": "urn://x-artefacts-zags-pernameinf/root/112-53/4.0.0 zags-pernameinf-ru-root.xsd",
    "СведОтветАГС": {
      "ИдДок": "0bde2079-eded-11ea-952d-00155d01aa21",
      "РезОбраб": "1",
      "СведРегПерИмя": {
        "РазделЕГР": "1",
        "НомерЗаписЕГР": "160079060000401234123",
        "НомАГССвид": "125478",
        "НомерВерс": "0",
        "ДатаВерс": "1957-08-13",
        "КодСостСтат": "0101",
        "ДатаЗапис": "1957-08-13",
        "ОрганЗАГС": {
          "НаимЗАГС": "Отдел Государственной службы записи актов гражданского состояния Республики Ингушетия Джейрахского района",
          "КодЗАГС": "R0600004"
        },
        "СвидетПерИмя": {
          "ТипСвидет": "1",
          "СерияСвидет": "XII-АА",
          "НомерСвидет": "2134578",
          "ДатаВыдСвидет": "2006-05-24"
        },
        "ПрдСведРег": {
          "ГраждОКСМ": "643",
          "ФИОДо": {
            "Фамилия": "Михайлов",
            "Имя": "Петр",
            "Отчество": "Петрович"
          },
          "ФИОПосле": {
            "Фамилия": "Михайлов",
            "Имя": "Алексей",
            "Отчество": "Петрович"
          },
          "ДатаРождКаленд": "1993-06-18",
          "МестоРожден": {
            "ПризнМесто": "1",
            "МестоТекст": "Российская Федерация, Тюменская область, г. Тюмень",
            "КодСтраны": "643",
            "НаимСтраны": "Российская Федерация",
            "Регион": "72",
            "НаимСубъект": "Тюменская область",
            "Город": "Тюмень"
          },
          "АдрМЖ": {
            "АдрМЖРФ": {
              "АдрРФФИАС": {
                "АдрТекст": "Российская Федерация, Тюменская область, г. Тюмень, ул. Николая Федорова, д.17, кв.309",
                "ИдНом": "6ce4f31e-2f77-427a-8a50-5c2175ba0cc0",
                "ОКТМО": "71701000",
                "Индекс": "000000",
                "КодРегион": "72",
                "НаимРегион": "Тюменская область",
                "Город": "Тюмень",
                "Улица": "ул Николая Федорова",
                "Дом": "17",
                "Кварт": "309"
              }
            }
          },
          "УдЛичнФЛ": {
            "КодВидДок": "21",
            "СерДок": "4587",
            "НомДок": "589621",
            "ДатаДокКаленд": "2007-01-28",
            "ВыдДок": "Отдел УФМС России по Тюменской области в Центральном административном округе города Тюмени",
            "ПрКодВыдДок": "1"
          },
          "СведРегРожд": {
            "ЗапАктОсн": {
              "ТипАГС": "01",
              "НомерЗапис": "110109060000401234123",
              "ПрДатаЗапис": "1",
              "ОрганЗАГС": {
                "НаимЗАГС": "Отдел Государственной службы записи актов гражданского состояния Республики Ингушетия Джейрахского района",
                "КодЗАГС": "R0600004"
              }
            }
          }
        }
      }
    }
  }
}

},

}